# Tap
tap "blacktop/tap"
tap "homebrew/bundle"
tap "homebrew/services"

# Formulaes
brew "blacktop/tap/lporg" # Organize Your macOS Launchpad Apps
brew "mas" # Mac App Store CLI

# Development
brew "php"
brew "composer"
brew "node"
cask "devutils"
cask "iterm2"
cask "postman"
cask "sequel-ace"
cask "visual-studio-code"

# Apps
cask "appcleaner"
cask "arc"
cask "cheatsheet"
cask "couleurs"
cask "discord"
cask "docker"
cask "google-chrome"
cask "logi-options+"
cask "mos"
cask "obsidian"
cask "raycast"
cask "the-unarchiver"
cask "whatsapp"

# Fonts
cask "font-fira-code"
cask "font-jetbrains-mono"

# Mac App Store
mas "Magnet", id: 441258766
mas "Usage", id: 1561788435
mas "iHosts", id: 1102004240

# VS code
vscode "akamud.vscode-theme-onedark"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-diff"
vscode "file-icons.file-icons"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "fyzhu.git-pretty-graph"
vscode "jock.svg"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "ms-vscode.atom-keybindings"
vscode "naumovs.color-highlight"
vscode "onecentlin.laravel-blade"
vscode "onecentlin.laravel5-snippets"
vscode "open-southeners.laravel-pint"
vscode "qwtel.sqlite-viewer"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "shardulm94.trailing-spaces"
vscode "streetsidesoftware.code-spell-checker"
vscode "vue.volar"
vscode "wayou.vscode-todo-highlight"
vscode "xabikos.javascriptsnippets"
