
# Taps
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'bash' # Latest Bash version
brew 'git'
brew 'pure'
brew 'mas' # Mac App Store manager
brew 'mackup'

# Development
brew 'php'
brew 'php@8.1'
brew 'composer'
brew 'dnsmasq'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'

# Apps
cask '1password'
cask 'binance'
cask 'cheatsheet'
cask 'couleurs'
cask 'devutils'
cask 'discord'
cask 'figma'
cask 'firefox'
cask 'fork'
cask 'google-chrome'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'logi-options-plus'
cask 'mos'
cask 'obsidian'
cask 'phpmon'
cask 'postman'
cask 'raycast'
cask 'sequel-ace'
cask 'signal'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'whatsapp'

# Fonts
cask 'font-lato'
cask 'font-fira-code'
cask 'font-open-sans'
cask 'font-source-code-pro'

# Mac App Store
mas 'Magnet', id: 441258766
mas 'Usage', id: 1561788435
